# How to prevent access control vulnerabilities

Уязвимости контроля доступа, как правило, можно предотвратить, применяя многоуровневый подход к защите и применяя следующие принципы:

* Никогда не полагайтесь только на обфускацию для контроля доступа. (Обфускация - приведение исходного текста или исполняемого кода программы к виду, сохраняющему её функциональность, но затрудняющему анализ, понимание алгоритмов работы и модификацию при декомпиляции.)
* Если ресурс не предназначен для публичного доступа, запретите доступ по умолчанию.
* По возможности используйте единый механизм управления доступом для всего приложения.
* На уровне кода сделайте так, чтобы разработчики обязательно объявляли доступ, разрешенный для каждого ресурса, и запрещайте доступ по умолчанию.
* Тщательно проверьте и протестируйте элементы управления доступом, чтобы убедиться, что они работают должным образом.
